/* ****************************** 作者：残弈悟恩 *****************************************
 * 文件名称 : FsBSP_Timer.c
 * 文件描述 : 定时器和中断驱动程序
 * 硬件平台 ：飛天三號 FSST15实验板
 * 软件环境 ：Keil uVision5.13
 * 
 * 版本代号	: V1.0 	   					
 * 修改日期	: 2015-07-11
 * 技术论坛 ：电子工程师基地（http://www.ieebase.net）
 * 淘宝店铺 ：http://fsmcu.taobao.com
 
 * Copyright (C), 2014-2015, 兰州文轩电子科技有限公司
 
 * 仅供学习使用，未经作者许可，不得用于其它商业用途，盗版必究。
************************************************************************************** */

#include "FsBSP_Timer.h"
#include "FsBSP_HC595.h"
#include "FsBSP_Delay.h"

/* ******************************************************************
* 函数名称： Timer0_Init()
* 入口参数：无
* 出口参数：无
* 函数功能：初始化定时器 0
****************************************************************** */
void Timer0_Init(void)
{
	TMOD = 0x00;  // 设置定时器 0 工作在模式 0 下
	TH0 = 0xDC;   // 定时基准为 10ms
	TL0 = 0x00;   // 赋初始值
	TR0 = 1; 	  // 开定时器 0
	ET0 = 1;      //打开定时器0的中断标志位
	EA = 1;       //开总中断
}

/* ******************************************************************
* 函数名称： StopwatchCount()
* 入口参数：无
* 出口参数：无
* 函数功能：秒表计数函数，每隔10ms调用一次进行秒表计数累加
****************************************************************** */
void StopwatchCount()
{
        DecimalPart++;           //小数部分+1
        if (DecimalPart >= 100)  //小数部分计到100时进位到整数部分
        {
            DecimalPart = 0;
            IntegerPart++;       //整数部分+1
            if (IntegerPart >= 1000)  //整数部分计到10000时归零
            {
                IntegerPart = 0;
            }
        }
}
/* ******************************************************************
 * 函数名称：StopwatchDisplay()
 * 入口参数：无
 * 出口参数：无
 * 函数功能：秒表计数显示函数
****************************************************************** */
void StopwatchDisplay()
{
	signed char x,y;
	unsigned char buf[4];  //数据转换的缓冲区
    
    //小数部分转换到低2位
    LedBuff[5] =  Disp_Tab[DecimalPart%10];
    LedBuff[4] =  Disp_Tab[DecimalPart/10];
    //整数部分转换到高4位
    buf[3] = (IntegerPart%10);
    buf[2] = (IntegerPart/10)%10;
    buf[1] = (IntegerPart/100)%10;
    buf[0] = (IntegerPart/1000)%10;
	
	
    for ( x=3; x>=0; x--)  //有效数字位转换为显示字符
    {
        LedBuff[x] =  Disp_Tab[buf[x]];
    }

	
	for(y = 0;y<6;y++)
		{
			P6 = Bit_Tab[y];
			HC595_WrOneByte(LedBuff[y]);
			HC595_WrOneByte(0x00);
			
	    }
}
/* ******************************************************************
* 函数名称：Timer0_ISR(void) 
* 入口参数：无
* 出口参数：无
* 函数功能：定时器0的中断函数
****************************************************************** */
void Timer0_ISR(void) interrupt 1
{
	EA = 0;
	
	TH0 = 0xDC;   // 定时基准为 10ms
	TL0 = 0x00;   // 赋初始值
	
	
    uiCounter ++;
	
    if (uiCounter >= 5)    //大于5，说明1s到了
    {
        uiCounter = 0;
	
		StopwatchCount();  //调用秒表计数函数
		
    }
	
	EA = 1;

}





