/* ****************************** 作者：残弈悟恩 *****************************************
 * 文件名称 : main.c
 * 文件描述 : 高低电平反转法矩阵键盘的应用实例
 * 硬件平台 ：飛天三號 FSST15实验板
 * 软件环境 ：Keil uVision5.13
 * 
 * 版本代号	: V1.0 	   					
 * 修改日期	: 2015-08-08
 * 技术论坛 ：电子工程师基地（http://www.ieebase.net）
 * 淘宝店铺 ：http://fsmcu.taobao.com
 * 例程说明 ：本例程为教材《与STC15单片机牵手的那些年》（清华大学出版社）配套例程
			  为视频《深入浅出玩转STC15单片机》配套例程（录制100讲--西安：愚公）
			  视频和书籍均被STC（深圳宏晶科技）官方大学计划和高校高性能联合实验室权威推荐

 * Copyright (C), 2013-2015, 兰州文轩电子科技有限公司/清华大学出版社
 
 * 仅供学习使用，未经作者许可，不得用于其它商业用途，盗版必究。
************************************************************************************** */


#include "FsBSP_Delay.h"
#include "FsBSP_Key.h"
#include "FsBSP_HC595.h"
#include "FsBSP_AllLedFlash.h"
/* ***************************************************** */
// 宏定义
/* ***************************************************** */
#define uInt16 unsigned int
#define uChar8 unsigned char
/* ***************************************************** */
// 全局变量定义
/* ***************************************************** */
uChar8 g_ucKeyNum = 16;         //键值


unsigned char  SMG_Array[] = {0x3f,0x06,0x5b,0x4f,0x66,0x6d,0x7d,0x07,
0x7f,0x6f,0x77,0x7c,0x39,0x5e,0x79,0x71};  // 0 ~ F
/* ***************************************************** */
// 函数名称：main()
// 函数功能：矩阵按键扫描并用数码管显示键值
// 入口参数：无
// 出口参数：无
/* ***************************************************** */
void main(void)
{
	LedGPIO_Init();
	
	while(1)	  
	{	
		ScanKey();
		Display(g_ucKeyNum);
	}
}							
/* *********************************** End of File *********************************** */
