/* ****************************** 作者：残弈悟恩 *****************************************
 * 文件名称 : RTX51_Traffic.c
 * 文件描述 : RTX51 Tiny + 交通灯
 * 硬件平台 ：飛天三號 FSST15实验板
 * 软件环境 ：Keil uVision5.13
 * 
 * 版本代号	: V1.0 	   					
 * 修改日期	: 2015-09-12
 * 技术论坛 ：电子工程师基地（http://www.ieebase.net）
 * 淘宝店铺 ：http://fsmcu.taobao.com
 * 例程说明 ：本例程为教材《与STC15单片机牵手的那些年》（清华大学出版社）配套例程
			  为视频《深入浅出玩转STC15单片机》配套例程（录制100讲--西安：愚公）
			  视频和书籍均被STC（深圳宏晶科技）官方大学计划和高校高性能联合实验室权威推荐

 * Copyright (C), 2013-2015, 兰州文轩电子科技有限公司/清华大学出版社
 
 * 仅供学习使用，未经作者许可，不得用于其它商业用途，盗版必究。
************************************************************************************** */

#include "BSP_Include.h"
#include "rtx51tny.h"
#include "RTX51_METEORLAMP.h"

/* ********************************************************
/* 函数名称：Init_Task()									 
/* 函数功能：初始化任务函数（任务号为：0）					 
/* 入口参数：无						 
/* 出口参数：无										
******************************************************** */
void InitLed_Task(void) _task_ InitLed_ID
{
	GPIO_ConfigInit();			// 配置IO口
	
	os_create_task(N_rLed_ID);	// 启动LED1_ID（1）任务
	os_create_task(N_yLed_ID);
	os_create_task(N_gLed_ID);
	os_create_task(E_rLed_ID);
	os_create_task(E_yLed_ID);
	os_create_task(E_gLed_ID);
	os_create_task(S_rLed_ID);
	os_create_task(S_yLed_ID);
	os_create_task(S_gLed_ID);
	os_create_task(W_rLed_ID);
	os_create_task(W_yLed_ID);
	os_create_task(W_gLed_ID);	
								// 初始化只需一遍就行了
	os_delete_task(InitLed_ID);	// 删除INIT_ID（0）任务
}
/* ********************************************************
/* 函数名称：LED1_Task()									 
/* 函数功能：LED1任务函数（任务号为：1）					 
/* 入口参数：无						 
/* 出口参数：无										
******************************************************** */
void LED1_Task(void) _task_ N_rLed_ID
{
	while(1)
	{
		N_rLed = 0;
		os_wait(K_TMO,24,0);	// 等待24个滴答中断，时间为（(12/11059200)*800*24）
		N_rLed = 1;
		os_wait(K_TMO,1,0);		// 等待24个滴答中断，时间为（(12/11059200)*800*1）
	}
}
/* ********************************************************
/* 函数名称：LED2_Task()									 
/* 函数功能：LED2任务函数（任务号为：2）					 
/* 入口参数：无						 
/* 出口参数：无										
******************************************************** */
void LED2_Task(void) _task_ N_yLed_ID
{
	while(1)
	{
		N_yLed = 0;
		os_wait(K_TMO,20,0);	// 同理如上
		N_yLed = 1;
		os_wait(K_TMO,4,0);		// 同理如上
	}
}
/* ********************************************************
/* 函数名称：LED3_Task()									 
/* 函数功能：LED3任务函数（任务号为：3）					 
/* 入口参数：无						 
/* 出口参数：无										
******************************************************** */
void LED3_Task(void) _task_ N_gLed_ID
{
	while(1)
	{
		N_gLed = 0;
		os_wait(K_TMO,18,0);
		N_gLed = 1;
		os_wait(K_TMO,6,0);		
	}
}
/* ********************************************************
/* 函数名称：LED4_Task()									 
/* 函数功能：LED4任务函数（任务号为：4）					 
/* 入口参数：无						 
/* 出口参数：无										
******************************************************** */
void LED4_Task(void) _task_ E_rLed_ID
{
	while(1)
	{
		E_rLed = 0;
		os_wait(K_TMO,16,0);
		E_rLed = 1;
		os_wait(K_TMO,8,0);		
	}
}
/* ********************************************************
/* 函数名称：LED5_Task()									 
/* 函数功能：LED5任务函数（任务号为：5）					 
/* 入口参数：无						 
/* 出口参数：无										
******************************************************** */
void LED5_Task(void) _task_ E_yLed_ID
{
	while(1)
	{
		E_yLed = 0;
		os_wait(K_TMO,14,0);
		E_yLed = 1;
		os_wait(K_TMO,10,0);		
	}
}
/* ********************************************************
/* 函数名称：LED6_Task()									 
/* 函数功能：LED6任务函数（任务号为：6）					 
/* 入口参数：无						 
/* 出口参数：无										
******************************************************** */
void LED6_Task(void) _task_ E_gLed_ID
{
	while(1)
	{
		E_gLed = 0;
		os_wait(K_TMO,12,0);
		E_gLed = 1;
		os_wait(K_TMO,12,0);		
	}
}
/* ********************************************************
/* 函数名称：LED7_Task()									 
/* 函数功能：LED7任务函数（任务号为：7）					 
/* 入口参数：无						 
/* 出口参数：无										
******************************************************** */
void LED7_Task(void) _task_ S_rLed_ID
{
	while(1)
	{
		S_rLed = 0;
		os_wait(K_TMO,10,0);
		S_rLed = 1;
		os_wait(K_TMO,14,0);		
	}
}
/* ********************************************************
/* 函数名称：LED8_Task()									 
/* 函数功能：LED8任务函数（任务号为：8）					 
/* 入口参数：无						 
/* 出口参数：无										
******************************************************** */
void LED8_Task(void) _task_ S_yLed_ID
{
	while(1)
	{
		S_yLed = 0;
		os_wait(K_TMO,8,0);
		S_yLed = 1;
		os_wait(K_TMO,16,0);		
	}
}
/* ********************************************************
/* 函数名称：LED9_Task()									 
/* 函数功能：LED9任务函数（任务号为：9）					 
/* 入口参数：无						 
/* 出口参数：无										
******************************************************** */
void LED9_Task(void) _task_ S_gLed_ID
{
	while(1)
	{
		S_gLed = 0;
		os_wait(K_TMO,6,0);
		S_gLed = 1;
		os_wait(K_TMO,18,0);		
	}
}
/* ********************************************************
/* 函数名称：LED10_Task()									 
/* 函数功能：LED10任务函数（任务号为：10）					 
/* 入口参数：无						 
/* 出口参数：无										
******************************************************** */
void LED10_Task(void) _task_ W_rLed_ID 
{
	while(1)
	{
		W_rLed = 0;
		os_wait(K_TMO,4,0);
		W_rLed = 1;
		os_wait(K_TMO,20,0);		
	}
}
/* ********************************************************
/* 函数名称：LED11_Task()									 
/* 函数功能：LED11任务函数（任务号为：11）					 
/* 入口参数：无						 
/* 出口参数：无										
******************************************************** */
void LED11_Task(void) _task_ W_yLed_ID
{
	while(1)
	{
		W_yLed = 0;
		os_wait(K_TMO,2,0);
		W_yLed = 1;
		os_wait(K_TMO,22,0);		
	}
}
/* ********************************************************
/* 函数名称：LED12_Task()									 
/* 函数功能：LED12任务函数（任务号为：12）					 
/* 入口参数：无						 
/* 出口参数：无										
******************************************************** */
void LED12_Task(void) _task_ W_gLed_ID
{
	while(1)
	{
		W_gLed = 0;
		os_wait(K_TMO,1,0);
		W_gLed = 1;
		os_wait(K_TMO,24,0);		
	}
}
/* *********************************** End of File *********************************** */
