/* ****************************** 作者：残弈悟恩 *****************************************
 * 文件名称 : FsBSP_Timer.c
 * 文件描述 : 定时器和中断驱动程序
 * 硬件平台 ：飛天三號 FSST15实验板
 * 软件环境 ：Keil uVision5.13
 * 
 * 版本代号	: V1.0 	   					
 * 修改日期	: 2015-07-11
 * 技术论坛 ：电子工程师基地（http://www.ieebase.net）
 * 淘宝店铺 ：http://fsmcu.taobao.com
 
 * Copyright (C), 2014-2015, 兰州文轩电子科技有限公司
 
 * 仅供学习使用，未经作者许可，不得用于其它商业用途，盗版必究。
************************************************************************************** */

#include "FsBSP_Timer.h"
#include "STC15.h"
#include "FsBSP_Delay.h"
#include "FsBSP_Uart.h"

/* ******************************************************************
* 函数名称：void Timer0_1ms()
* 入口参数：无
* 出口参数：无
* 函数功能：初始化定时器 0并且定时1ms
****************************************************************** */
void Timer0_1ms()
{
		AUXR &= 0x7F;		//定时器时钟12T模式
		TMOD &= 0xF0;		//设置定时器模式
		TL0 = 0x66;		//设置定时初值
		TH0 = 0xFC;		//设置定时初值
		TF0 = 0;		//清除TF0标志
		TR0 = 1;		//定时器0开始计时
		ET0 =1;
	
//	  AUXR &= 0x7F;		//定时器时钟12T模式
//		TMOD &= 0xF0;		//设置定时器模式
//		TL0 = 0x66;		//设置定时初值
//		TH0 = 0xFC;		//设置定时初值
//		TF0 = 0;		//清除TF0标志
//		TR0 = 1;		//定时器0开始计时
//		ET0 =1;

}
/* ******************************************************************
* 函数名称：void InterruptTimer0() interrupt 1
* 入口参数：无
* 出口参数：无
* 函数功能：T0中断服务函数，执行串口接收监控和LED灯驱动
****************************************************************** */
void InterruptTimer0() interrupt 1
{
	
	  TH0 = 0xFC;  //重新加载重载值
    TL0 = 0x66;
    
    if (flagBuzzAndLedOn)  //执行蜂鸣器鸣叫或关闭
		{
        BUZZ = ~BUZZ;
				LED = ~LED;
		}
    else
		{
				LED = 1;
        BUZZ = 1;
		}
    UartRxMonitor(1);  //串口接收监控
}

/* *********************************** End of File *********************************** */
