/* ****************************** 作者：残弈悟恩 *****************************************
 * 文件名称 : main.c
 * 文件描述 : 触摸按键应用实例
 * 硬件平台 ：飛天三號 FSST15实验板
 * 软件环境 ：Keil uVision5.13
 * 
 * 版本代号	: V1.0 	   					
 * 修改日期	: 2015-09-19
 * 技术论坛 ：电子工程师基地（http://www.ieebase.net）
 * 淘宝店铺 ：http://fsmcu.taobao.com
 * 例程说明 ：本例程为教材《与STC15单片机牵手的那些年》（清华大学出版社）配套例程
			  为视频《深入浅出玩转STC15单片机》配套例程（录制100讲--西安：愚公）
			  视频和书籍均被STC（深圳宏晶科技）官方大学计划和高校高性能联合实验室权威推荐

 * Copyright (C), 2013-2015, 兰州文轩电子科技有限公司/清华大学出版社
 
 * 仅供学习使用，未经作者许可，不得用于其它商业用途，盗版必究。
************************************************************************************** */
/////////////////////////////////
//头文件
#include	"BSP_Include.h"
//此程序时钟要为24MHZ
/*************	本地变量声明	**************/
sbit	P_LED7 = P7^7;
sbit	P_LED6 = P7^6;
sbit	P_LED5 = P7^5;
sbit	P_LED4 = P7^4;
sbit	P_LED3 = P7^3;
sbit	P_LED2 = P7^2;
sbit	P_LED1 = P7^1;
sbit	P_LED0 = P7^0;
u8	cnt_250ms;
/********************* 键处理 50ms调用1次 *************************/
void	ShowLED(void)
{
	u8	i;
	
	i = check_adc(0);
	if(i == 0)		P_LED0 = 1;	//指示灯灭
	if(i == 1)		P_LED0 = 0;	//指示灯亮

	i = check_adc(1);
	if(i == 0)		P_LED1 = 1;	//指示灯灭
	if(i == 1)		P_LED1 = 0;	//指示灯亮

	i = check_adc(2);
	if(i == 0)		P_LED2 = 1;	//指示灯灭
	if(i == 1)		P_LED2 = 0;	//指示灯亮

	i = check_adc(3);
	if(i == 0)		P_LED3 = 1;	//指示灯灭
	if(i == 1)		P_LED3 = 0;	//指示灯亮

	i = check_adc(4);
	if(i == 0)		P_LED4 = 1;	//指示灯灭
	if(i == 1)		P_LED4 = 0;	//指示灯亮

	i = check_adc(5);
	if(i == 0)		P_LED5 = 1;	//指示灯灭
	if(i == 1)		P_LED5 = 0;	//指示灯亮

	i = check_adc(6);
	if(i == 0)		P_LED6 = 1;	//指示灯灭
	if(i == 1)		P_LED6 = 0;	//指示灯亮

	i = check_adc(7);
	if(i == 0)		P_LED7 = 1;	//指示灯灭
	if(i == 1)		P_LED7 = 0;	//指示灯亮

}

/******************** 主函数 **************************/
void main(void)
{
	u8	i;

	Delay_ms(50);

	Timer0_Init();

	ADC_init();		//ADC初始化
	Delay_ms(50);	//延时50ms

	for(i=0; i<TOUCH_CHANNEL; i++)		//初始化0点和上一个值和0点自动跟踪计数
	{
		adc_prev[i]  = 1023;
		TouchZero[i] = 1023;
		TouchZeroCnt[i] = 0;
	}
	cnt_250ms = 0;

	while (1)
	{
		Delay_ms(50);		//每隔50ms处理一次按键
		ShowLED();
		if(++cnt_250ms >= 5)
		{
			cnt_250ms = 0;
			AutoZero();		//每隔250ms处理一次0点自动跟踪
		}
		
	}
}
/* *********************************** End of File *********************************** */