/* ****************************** 作者：残弈悟恩 *****************************************
 * 文件名称 : main.c
 * 文件描述 : 数码管动态刷新驱动
 * 硬件平台 ：飛天三號 FSST15实验板
 * 软件环境 ：Keil uVision5.13
 * 
 * 版本代号	: V1.0 	   					
 * 修改日期	: 2015-07-05
 * 技术论坛 ：电子工程师基地（http://www.ieebase.net）
 * 淘宝店铺 ：http://fsmcu.taobao.com
 
 * Copyright (C), 2014-2015, 兰州文轩电子科技有限公司
 
 * 仅供学习使用，未经作者许可，不得用于其它商业用途，盗版必究。
************************************************************************************** */

#include "FsBSP_HC595.h"
#include "FsBSP_Delay.h"

/* ***************************************************** */
// 数组定义
/* ***************************************************** */
unsigned char code Bit_Tab[] = 
{0xfe,0xfd,0xfb,0xf7,0xef,0xdf,0xbf,0x7f};		//位选数组

unsigned char code Disp_Tab[] = 
{0x3f,0x06,0x5b,0x4f,0x66,0x6d,0x7d,0x07};	 	//0~7数字显示编码数组

void main(void)
{
	unsigned char i = 0;
	
	while(1)
	{
		for (i = 0;i < 8;i++)
		{
			HC595_WrOneByte(Disp_Tab[i]);	// 依次送入8个段码数据
			P6 = Bit_Tab[i];				// 依次送入8个位选数据
			DelayMS(2);						// 延时一小段时间，以便观察
		}
	}
}

/* *********************************** End of File *********************************** */