/* ****************************** 作者：残弈悟恩 *****************************************
 * 文件名称 : STC15_ClkConfig.h
 * 硬件平台 ：飛天三號 FSST15实验板
 * 软件环境 ：Keil uVision5.13
 * 
 * 版本代号	: V1.0 	   					
 * 修改日期	: 2015-08-11
 * 技术论坛 ：电子工程师基地（http://www.ieebase.net）
 * 淘宝店铺 ：http://fsmcu.taobao.com
 * 文件说明 ：本例程为教材《与STC15单片机牵手的那些年》（清华大学出版社）配套例程
			  为视频《深入浅出玩转STC15单片机》配套例程（录制100讲--西安：愚公）
			  视频和书籍均被STC（深圳宏晶科技）官方大学计划和高校高性能联合实验室权威推荐

 * Copyright (C), 2013-2015, 刘平（xymbmcu@163.com）/清华大学出版社/STC MCU Limited
 
 * 仅供学习使用，未经作者许可，不得用于其它商业用途，盗版必究。
************************************************************************************** */

#ifndef		__STC15_CLKVARTYPE_H__
#define		__STC15_CLKVARTYPE_H__

/* ****************************************************************************
 * 用户依据自己的项目选定系统运行的主频，飛天三號默认为：11059200L
 *************************************************************************** */
#define MAIN_Fosc		11059200L	//定义主时钟
//#define MAIN_Fosc		12000000L	//定义主时钟
//#define MAIN_Fosc		18432000L	//定义主时钟
//#define MAIN_Fosc		22118400L	//定义主时钟
//#define MAIN_Fosc		24000000L	//定义主时钟
//#define MAIN_Fosc		30000000L	//定义主时钟

/* ****************************************************************************
 * 为了编程方便，现定义一下变量类型
 *************************************************************************** */
typedef   signed          char int8;
typedef   signed short     int int16;
typedef   signed           int int32;

typedef unsigned          char uint8;
typedef unsigned short     int uint16;
typedef unsigned           int uint32;

#include "STC15_FS.H"

/* ************************************************************************* */

#endif
